EA/src/InformationRegisters/НастройкиВыгрузкиЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиВыгрузкиЗаказовПоставщикам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Папка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>have_field_names</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеГрузополучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодГрузополучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>POZ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PAYID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комметарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коробочный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EA/src/InformationRegisters/НастройкиВыгрузкиЗаказовПоставщикам/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("ОбновитьСтрокуНастройкиЗагрузок");

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	Если ПустаяСтрока(Запись.Формат) Тогда
		ПоказатьПредупреждение(, "Не указан формат выгружаемого файла с заказом поставщику", 20);
		Возврат;
	КонецЕсли;
	
	
	Отказ = Истина;
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоляПоУмолчанию", ЭтотОбъект),
    	"Заполнить поля данными по умолчанию?", РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоляПоУмолчанию(РезультатВопроса, ПараметрыЗаписи) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ВРег(СокрЛП(Запись.Формат)) = "DBF" Тогда

		Запись.Маска = "{number}.dbf";
		Запись.Кодировка = "CP866";
		Запись.Разделитель = "";
		Запись.НомерВыгрузки = 1;
		
		Запись.НомерЗаказа = "NUMZ,N,8,0";
		Запись.ДатаЗаказа = "DATEZ,D";
		Запись.Код = "CODEPST,S,12";
		Запись.Название = "NAME,S,80";
		Запись.Количество = "QNT,N,8,0";
		Запись.Цена = "PRICE,N,9,2";
		Запись.КодГрузополучателя = "PODR,S,12";
		Запись.НазваниеГрузополучателя = "PODRCD,S,40";
		Запись.Дата = "";
		Запись.Клиент = "";
		Запись.POZ = "";
		Запись.PAYID = "";
		Запись.Комметарий = "";
		Запись.Отказ = "";
		Запись.Коробочный = "";
		
	ИначеЕсли ВРег(СокрЛП(Запись.Формат)) = "TXT" Тогда

		Запись.Маска = "order{number}.txt";
		Запись.Кодировка = "Windows-1251";
		Запись.Разделитель = "|";
		Запись.НомерВыгрузки = 1;
		
		Запись.НомерЗаказа = "1";
		Запись.ДатаЗаказа = "";
		Запись.Код = "2";
		Запись.Название = "";
		Запись.Количество = "4";
		Запись.Цена = "3";
		Запись.КодГрузополучателя = "5";
		Запись.НазваниеГрузополучателя = "";
		Запись.Дата = "";
		Запись.Клиент = "";
		Запись.POZ = "";
		Запись.PAYID = "";
		Запись.Комметарий = "";
		Запись.Отказ = "";
		Запись.Коробочный = "";
		
	ИначеЕсли ВРег(СокрЛП(Запись.Формат)) = "ZIPPROTEK" Тогда

		Запись.Маска = "order{number}.xml";
		Запись.Кодировка = "";
		Запись.Разделитель = "";
		Запись.НомерВыгрузки = 1;
		
		Запись.НомерЗаказа = "";
		Запись.ДатаЗаказа = "";
		Запись.Код = "";
		Запись.Название = "";
		Запись.Количество = "";
		Запись.Цена = "";
		Запись.КодГрузополучателя = "";
		Запись.НазваниеГрузополучателя = "";
		Запись.Дата = "";
		Запись.Клиент = "";
		Запись.POZ = "";
		Запись.PAYID = "";
		Запись.Комметарий = "";
		Запись.Отказ = "";
		Запись.Коробочный = "";
		ПоказатьПредупреждение(, "Структура выгружаемого файла строго регламентирована,
			|заполнение наименований полей не обязательно.", 20);

		
	Иначе
		
		ПоказатьПредупреждение(, "Автоматическое заполнение данного формата не предусмотрено.
		|Заполните имена полей самостоятельно.", 20);
		
		Запись.Маска = "*." + НРег(СокрЛП(Запись.Формат));
		Запись.Кодировка = "";
		Запись.Разделитель = "";
		Запись.НачальнаяСтрока = 0;
		
		Запись.Код = "";
		Запись.Название = "";
		Запись.Производитель = "";
		Запись.СтранаПроизводитель = "";
		Запись.Баркод = "";
		Запись.ФормаВыпуска = "";
		Запись.КолВУпаковке = "";
		Запись.КодЕГК = "";
		Запись.Остаток = "";
		Запись.Цена = "";
		Запись.ЦенаРег = "";
		Запись.СтавкаНДС = "";
		Запись.СтавкаНСП = "";
		Запись.СрокГодности = "";
		Запись.Дата = "";
		Запись.ЖВЛ = "";

	КонецЕсли; 

КонецПроцедуры
